#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/blackboards/infrastructure/runs/run-yt3VLyberPTvV1ET

Waiting for the plan to start...

Terraform v1.1.9
on linux_amd64
Initializing plugins and modules...
digitalocean_domain.opentracker: Refreshing state... [id=opentracker.app]
digitalocean_domain.blackboards: Refreshing state... [id=blackboards.pl]
digitalocean_droplet.main: Refreshing state... [id=196151282]
digitalocean_droplet.secondary: Refreshing state... [id=332540871]
digitalocean_record.ns3: Refreshing state... [id=126390273]
digitalocean_record.ns1: Refreshing state... [id=126390270]
digitalocean_record.ns2: Refreshing state... [id=126390272]
digitalocean_record.opentracker-ns1: Refreshing state... [id=313829950]
digitalocean_record.opentracker-ns3: Refreshing state... [id=313829951]
digitalocean_record.opentracker-ns2: Refreshing state... [id=313829953]
digitalocean_record.opentracker-root: Refreshing state... [id=313829952]
digitalocean_record.opentracker: Refreshing state... [id=161872068]
digitalocean_record.starling-webhooks: Refreshing state... [id=309351439]
digitalocean_record.starling-listener: Refreshing state... [id=309272946]
digitalocean_record.root: Refreshing state... [id=126395676]
digitalocean_project.blackboards: Refreshing state... [id=d006b183-c896-4d41-a341-fb46d729eeb6]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # digitalocean_droplet_snapshot.original-main-snapshot will be created
  + resource "digitalocean_droplet_snapshot" "original-main-snapshot" {
      + created_at    = (known after apply)
      + droplet_id    = "196151282"
      + id            = (known after apply)
      + min_disk_size = (known after apply)
      + name          = "original-main-snapshot"
      + regions       = (known after apply)
      + size          = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.


```

</details>